---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType
source: html/c650c305-159f-20a2-457a-8d2cbfe2dc1a.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType

ConceptualConstructionType values for Roofs.

## Syntax (C#)
```csharp
public enum ConceptualConstructionRoofType
```